MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/screen.cpp
/*
 * lcd_interface.c
 *
 * Created: 2/8/2013 10:26:43 PM
 *  Author: XxXx
 */

#include "include/stm32f7xx.h"
#include "driver/stm32f7xx_hal_dsi.h"
#include "driver/stm32f7xx_hal_dma2d.h"
#include "driver/stm32f7xx_hal_ltdc_ex.h"
#include "driver/stm32f7xx_hal_ltdc.h"
#include "driver/stm32f7xx_hal_gpio.h"
#include "driver/stm32f7xx_hal_rcc.h"
#include "driver/stm32f7xx_hal_cortex.h"
#include "driver/stm32f7xx_hal.h"

#include <interface/screen.h>
//#include "driver/stm32469i_eval_sdram.h"

LTDC_HandleTypeDef LtdcHandler;
DMA2D_HandleTypeDef Dma2dHandle;
/**
 * @brief  LCD FB_StartAddress
 */
#define LCD_FB_START_ADDRESS       ((uint32_t)0xC0000000)

/**
 * @brief  Initializes the LCD layers.
 * @param  LayerIndex: Layer foreground or background
 * @param  FB_Address: Layer frame buffer
 * @retval None
 */
static void BSP_LCD_LayerDefaultInit(void *screenHeandle, uint16_t LayerIndex,
		uint32_t FB_Address)
{
	GI::Dev::Screen *pDisplay = (GI::Dev::Screen *) screenHeandle;
	LCD_LayerCfgTypeDef Layercfg;

	/* Layer Init */
	Layercfg.WindowX0 = 0;
	Layercfg.WindowX1 = pDisplay->LcdTimings->X;
	Layercfg.WindowY0 = 0;
	Layercfg.WindowY1 = pDisplay->LcdTimings->Y;
	Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
	Layercfg.FBStartAdress = FB_Address;
	Layercfg.Alpha = 255;
	Layercfg.Alpha0 = 0;
	Layercfg.Backcolor.Blue = 0;
	Layercfg.Backcolor.Green = 0;
	Layercfg.Backcolor.Red = 0;
	Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
	Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
	Layercfg.ImageWidth = pDisplay->LcdTimings->X;
	Layercfg.ImageHeight = pDisplay->LcdTimings->Y;
	pDisplay->DisplayData = (volatile unsigned int*) FB_Address;

	HAL_LTDC_ConfigLayer(&LtdcHandler, &Layercfg, LayerIndex);
}

/**
 * @brief  BSP LCD Reset
 *         Hw reset the LCD DSI activating its XRES signal (active low for some time)
 *         and desactivating it later.
 */
static void BSP_LCD_Reset(void)
{
	GPIO_InitTypeDef gpio_init_structure;

	__HAL_RCC_GPIOJ_CLK_ENABLE()
	;

	/* Configure the GPIO on PJ15 */
	gpio_init_structure.Pin = GPIO_PIN_15;
	gpio_init_structure.Mode = GPIO_MODE_OUTPUT_PP;
	gpio_init_structure.Pull = GPIO_PULLUP;
	gpio_init_structure.Speed = GPIO_SPEED_HIGH;

	HAL_GPIO_Init(GPIOJ, &gpio_init_structure);

	/* Activate XRES active low */
	HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_RESET);

	HAL_Delay(20); /* wait 20 ms */

	/* Desactivate XRES */
	HAL_GPIO_WritePin(GPIOJ, GPIO_PIN_15, GPIO_PIN_SET);

	/* Wait for 10ms after releasing XRES before sending commands */
	HAL_Delay(10);
}

/**
 * @brief  DMA2D Transfer completed callback
 * @param  hdma2d: DMA2D handle.
 * @note   This example shows a simple way to report end of DMA2D transfer, and
 *         you can add your own implementation.
 * @retval None
 */
void TransferComplete(DMA2D_HandleTypeDef *hdma2d)
{
	/* Turn LED1 On */
	//BSP_LED_On(LED1);
	/* The Blended image is now ready for display */
	//blended_image_ready = 1;
}
/**
 * @brief  DMA2D error callbacks
 * @param  hdma2d: DMA2D handle
 * @note   This example shows a simple way to report DMA2D transfer error, and you can
 *         add your own implementation.
 * @retval None
 */
static void TransferError(DMA2D_HandleTypeDef *hdma2d)
{
	/* Turn LED2 On */
	//BSP_LED_On(LED2);
}

/**
 * @brief  On Error Handler on condition TRUE.
 * @param  condition : Can be TRUE or FALSE
 * @retval None
 */
void OnError_Handler(uint32_t condition)
{
	if (condition)
	{
		//BSP_LED_On(LED3);
		while (1)
		{
			;
		} /* Blocking on error */
	}
}
/**
 * @brief DMA2D configuration.
 * @note  This function Configure the DMA2D peripheral :
 *        1) Configure the Transfer mode as memory to memory with blending.
 *        2) Configure the output color mode as RGB565 pixel format.
 *        3) Configure the Foreground
 *          - Foreground image is loaded from FLASH memory (RGB565_240x130_2[])
 *          - constant alpha value (decreased to see the background)
 *          - color mode as RGB565 pixel format
 *        4) Configure the Background
 *          - Background image loaded from FLASH memory (RGB565_240x130_1[])
 *          - color mode as RGB565 pixel format
 * @retval
 *  None
 */
static void DMA2D_Config(void)
{
	HAL_StatusTypeDef hal_status = HAL_OK;

	/* Configure the DMA2D Mode, Color Mode and output offset */
	Dma2dHandle.Init.Mode = DMA2D_M2M_BLEND; /* DMA2D mode Memory to Memory with Blending */
	Dma2dHandle.Init.ColorMode = DMA2D_RGB565; /* output format of DMA2D */
	Dma2dHandle.Init.OutputOffset = 0x0; /* No offset in output */

	/* DMA2D Callbacks Configuration */
	Dma2dHandle.XferCpltCallback = TransferComplete;
	Dma2dHandle.XferErrorCallback = TransferError;

	/* Foreground layer Configuration */
	Dma2dHandle.LayerCfg[1].AlphaMode = DMA2D_REPLACE_ALPHA;
	Dma2dHandle.LayerCfg[1].InputAlpha = 0x7F; /* 127 : semi-transparent */
	Dma2dHandle.LayerCfg[1].InputColorMode = CM_RGB565;
	Dma2dHandle.LayerCfg[1].InputOffset = 0x0; /* No offset in input */

	/* Background layer Configuration */
	Dma2dHandle.LayerCfg[0].AlphaMode = DMA2D_REPLACE_ALPHA;
	Dma2dHandle.LayerCfg[0].InputAlpha = 0x7F; /* 127 : semi-transparent */
	Dma2dHandle.LayerCfg[0].InputColorMode = CM_RGB565;
	Dma2dHandle.LayerCfg[0].InputOffset = 0x0; /* No offset in input */

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	hal_status = HAL_DMA2D_Init(&Dma2dHandle);
	OnError_Handler(hal_status != HAL_OK);

	/* Apply DMA2D Foreground configuration */
	HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1);

	/* Apply DMA2D Background configuration */
	HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0);
}

#if defined(STM32F429xx) || defined(STM32F439xx)|| defined(STM32F469xx) || defined(STM32F479xx)
/** @brief Maximum number of LTDC layers
 */
#define LTDC_MAX_LAYER_NUMBER             ((uint32_t) 2)
/** @brief LTDC Background layer index
 */
#define LTDC_ACTIVE_LAYER_BACKGROUND      ((uint32_t) 0)

/** @brief LTDC Foreground layer index
 */
#define LTDC_ACTIVE_LAYER_FOREGROUND      ((uint32_t) 1)

static void DMA2D_Config(void);

/**
 * @brief  This function handles LTDC Error interrupt Handler.
 * @note : Can be surcharged by application code implementation of the function.
 */

/*__weak void BSP_LCD_LTDC_ER_IRQHandler(void)
 {
 HAL_LTDC_IRQHandler(&(LtdcHandler));
 }*/

/**
 * @brief  Handles DMA2D interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_DMA2D_IRQHandler(void)
 {
 HAL_DMA2D_IRQHandler(&Dma2dHandle);
 }*/

/**
 * @brief  Handles LTDC interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_LTDC_IRQHandler(void)
 {
 HAL_LTDC_IRQHandler(&(LtdcHandler));
 }*/

/**
 * @brief  Converts a line to an ARGB8888 pixel format.
 * @param  pSrc: Pointer to source buffer
 * @param  pDst: Output color
 * @param  xSize: Buffer width
 * @param  ColorMode: Input color mode
 */
static void LL_ConvertLineToARGB8888(void *pSrc, void *pDst, uint32_t xSize, uint32_t ColorMode)
{
	/* Configure the DMA2D Mode, Color Mode and output offset */
	Dma2dHandle.Init.Mode = DMA2D_M2M_PFC;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = 0;

