MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/screen.cpp
	/* Foreground Configuration */
	Dma2dHandle.LayerCfg[1].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	Dma2dHandle.LayerCfg[1].InputAlpha = 0xFF;
	Dma2dHandle.LayerCfg[1].InputColorMode = ColorMode;
	Dma2dHandle.LayerCfg[1].InputOffset = 0;

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	if(HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if(HAL_DMA2D_ConfigLayer(&Dma2dHandle, 1) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, (uint32_t)pSrc, (uint32_t)pDst, xSize, 1) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 10);
			}
		}
	}
}

/**
 * @brief  Draws a bitmap picture loaded in the internal Flash (32 bpp) in currently active layer.
 * @param  Xpos: Bmp X position in the LCD
 * @param  Ypos: Bmp Y position in the LCD
 * @param  pbmp: Pointer to Bmp picture address in the internal Flash
 */
void BSP_LCD_DrawBitmap(void *_pDisplay, uint32_t Xpos, uint32_t Ypos, uint8_t *pbmp)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	uint32_t index = 0, width = 0, height = 0, bit_pixel = 0;
	uint32_t Address;
	uint32_t InputColorMode = 0;

	/* Get bitmap data address offset */
	index = *(volatile uint16_t *) (pbmp + 10);
	index |= (*(volatile uint16_t *) (pbmp + 12)) << 16;

	/* Read bitmap width */
	width = *(uint16_t *) (pbmp + 18);
	width |= (*(uint16_t *) (pbmp + 20)) << 16;

	/* Read bitmap height */
	height = *(uint16_t *) (pbmp + 22);
	height |= (*(uint16_t *) (pbmp + 24)) << 16;

	/* Read bit/pixel */
	bit_pixel = *(uint16_t *) (pbmp + 28);

	/* Set the address */
	Address = LtdcHandler.LayerCfg[0].FBStartAdress + (((pDisplay->LcdTimings->X*Ypos) + Xpos)*(4));

	/* Get the layer pixel format */
	if ((bit_pixel/8) == 4)
	{
		InputColorMode = CM_ARGB8888;
	}
	else if ((bit_pixel/8) == 2)
	{
		InputColorMode = CM_RGB565;
	}
	else
	{
		InputColorMode = CM_RGB888;
	}

	/* Bypass the bitmap header */
	pbmp += (index + (width * (height - 1) * (bit_pixel/8)));

	/* Convert picture to ARGB8888 pixel format */
	for(index=0; index < height; index++)
	{
		/* Pixel format conversion */
		LL_ConvertLineToARGB8888((uint32_t *)pbmp, (uint32_t *)Address, width, InputColorMode);

		/* Increment the source and destination buffers */
		Address+= (pDisplay->LcdTimings->X*4);
		pbmp -= width*(bit_pixel/8);
	}
}

/**
 * @brief  De-Initializes the BSP LCD Msp
 * Application can surcharge if needed this function implementation.
 */
__weak void BSP_LCD_MspDeInit(void)
{
	/** @brief Disable IRQ of LTDC IP */
	HAL_NVIC_DisableIRQ(LTDC_IRQn);

	/** @brief Disable IRQ of DMA2D IP */
	HAL_NVIC_DisableIRQ(DMA2D_IRQn);

	/** @brief Disable IRQ of DSI IP */
	HAL_NVIC_DisableIRQ(DSI_IRQn);

	/** @brief Force and let in reset state LTDC, DMA2D and DSI Host + Wrapper IPs */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_DMA2D_FORCE_RESET();
	__HAL_RCC_DSI_FORCE_RESET();

	/** @brief Disable the LTDC, DMA2D and DSI Host and Wrapper clocks */
	__HAL_RCC_LTDC_CLK_DISABLE();
	__HAL_RCC_DMA2D_CLK_DISABLE();
	__HAL_RCC_DSI_CLK_DISABLE();
}

/**
 * @brief  Initialize the BSP LCD Msp.
 * Application can surcharge if needed this function implementation
 */
__weak void BSP_LCD_MspInit(void)
{
	/** @brief Enable the LTDC clock */
	__HAL_RCC_LTDC_CLK_ENABLE();

	/** @brief Toggle Sw reset of LTDC IP */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_LTDC_RELEASE_RESET();

	/** @brief Enable the DMA2D clock */
	__HAL_RCC_DMA2D_CLK_ENABLE();

	/** @brief Toggle Sw reset of DMA2D IP */
	__HAL_RCC_DMA2D_FORCE_RESET();
	__HAL_RCC_DMA2D_RELEASE_RESET();

	/** @brief Enable DSI Host and wrapper clocks */
	__HAL_RCC_DSI_CLK_ENABLE();

	/** @brief Soft Reset the DSI Host and wrapper */
	__HAL_RCC_DSI_FORCE_RESET();
	__HAL_RCC_DSI_RELEASE_RESET();

	/** @brief NVIC configuration for LTDC interrupt that is now enabled */
	HAL_NVIC_SetPriority(LTDC_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(LTDC_IRQn);

	/** @brief NVIC configuration for DMA2D interrupt that is now enabled */
	HAL_NVIC_SetPriority(DMA2D_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(DMA2D_IRQn);

	/** @brief NVIC configuration for DSI interrupt that is now enabled */
	HAL_NVIC_SetPriority(DSI_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(DSI_IRQn);
}

/**
 * @brief  Initializes the LCD.
 * @param  None
 * @retval LCD state
 */
uint8_t BSP_LCD_Init(void *_pDisplay)
{
	tDisplay *pDisplay = (tDisplay *)_pDisplay;
	/* On STM32F429I-DISCO, it is not possible to read ILI9341 ID because */
	/* PIN EXTC is not connected to VDD and then LCD_READ_ID4 is not accessible. */
	/* In this case, ReadID function is bypassed.*/
	/*if(ili9341_drv.ReadID() == ILI9341_ID)*/

	/* LTDC Configuration ----------------------------------------------------*/
	LtdcHandler.Instance = LTDC;

	/* Timing configuration  (Typical configuration from ILI9341 datasheet)
	 HSYNC=10 (9+1)
	 HBP=20 (29-10+1)
	 ActiveW=240 (269-20-10+1)
	 HFP=10 (279-240-20-10+1)

	 VSYNC=2 (1+1)
	 VBP=2 (3-2+1)
	 ActiveH=320 (323-2-2+1)
	 VFP=4 (327-320-2-2+1)
	 */

	/* Configure horizontal synchronization width */
	LtdcHandler.Init.HorizontalSync = pDisplay->LcdTimings->hsw;
	/* Configure vertical synchronization height */
	LtdcHandler.Init.VerticalSync = pDisplay->LcdTimings->vsw;
	/* Configure accumulated horizontal back porch */
	LtdcHandler.Init.AccumulatedHBP = pDisplay->LcdTimings->hbp;
	/* Configure accumulated vertical back porch */
	LtdcHandler.Init.AccumulatedVBP = pDisplay->LcdTimings->vbp;
	/* Configure accumulated active width */
	LtdcHandler.Init.AccumulatedActiveW = pDisplay->LcdTimings->X + pDisplay->LcdTimings->hbp;
	/* Configure accumulated active height */
	LtdcHandler.Init.AccumulatedActiveH = pDisplay->LcdTimings->Y + pDisplay->LcdTimings->vbp;
	/* Configure total width */
	LtdcHandler.Init.TotalWidth = pDisplay->LcdTimings->X + pDisplay->LcdTimings->hbp + pDisplay->LcdTimings->hfp;
	/* Configure total height */
	LtdcHandler.Init.TotalHeigh = pDisplay->LcdTimings->Y + pDisplay->LcdTimings->vbp + pDisplay->LcdTimings->vfp;

	/* Configure R,G,B component values for LCD background color */
	LtdcHandler.Init.Backcolor.Red= 0;
	LtdcHandler.Init.Backcolor.Blue= 0;
	LtdcHandler.Init.Backcolor.Green= 0;

	/* Polarity */
	LtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
	LtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
	LtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
	LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;

	GPIO_InitTypeDef GPIO_InitStructure;

