MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/screen.cpp
	 //Calculate the destination locations on the screen.
	 dest_rectangle->sXMin += dest_X_StartBox;
	 dest_rectangle->sXMax += dest_X_StartBox;
	 dest_rectangle->sYMin += dest_Y_StartBox;
	 dest_rectangle->sYMax += dest_Y_StartBox;
	 if(dest_rectangle->sXMax < sClipRegion.sXMin ||
	 dest_rectangle->sYMax < sClipRegion.sYMin ||
	 dest_rectangle->sXMin >= sClipRegion.sXMax ||
	 dest_rectangle->sYMin >= sClipRegion.sYMax)
	 return;

	 //Limit the destination area to the picture box size.
	 clip_limit(dest_rectangle, &sClipRegion);

	 signed int x_line_len = dest_rectangle->sXMax - dest_rectangle->sXMin;

	 if(x_line_len <= 0)
	 return;
	 if(dest_X_StartBox <= dest_rectangle->sXMin)
	 dest_X_StartBox = dest_rectangle->sXMin;

	 signed int Y_cnt = dest_Y_StartBox;
	 if(Y_cnt <= dest_rectangle->sYMin)
	 Y_cnt = dest_rectangle->sYMin;

	 signed int X_Start_Src_Buff = sClipRegion.sXMin;
	 if(X_Start_Src_Buff > 0)
	 X_Start_Src_Buff = 0;
	 else
	 X_Start_Src_Buff = (~X_Start_Src_Buff) + 1;
	 signed int Y_Start_Src_Buff = sClipRegion.sYMin;
	 if(Y_Start_Src_Buff > 0)
	 Y_Start_Src_Buff = 0;
	 else
	 Y_Start_Src_Buff = (~Y_Start_Src_Buff) + 1;*/

	uint32_t destination =
			(uint32_t) ((volatile unsigned int *) LCD_FB_START_ADDRESS)
					+ ((y1 * LcdTimings->X + x1) * 4);
	uint32_t source = (uint32_t) rgb_buffer;

	/*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	Dma2dHandle.Init.Mode = DMA2D_M2M_PFC;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = LcdTimings->X - width;

	/*##-2- DMA2D Callbacks Configuration ######################################*/
	Dma2dHandle.XferCpltCallback = NULL;

	/*##-3- Foreground Configuration ###########################################*/
	Dma2dHandle.LayerCfg[0].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	Dma2dHandle.LayerCfg[0].InputAlpha = 0xFF;
	Dma2dHandle.LayerCfg[0].InputColorMode = CM_ARGB8888;
	Dma2dHandle.LayerCfg[0].InputOffset = 0;

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	if (HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if (HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, source, destination, width,
					height) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
			}
		}
	}
}
//#######################################################################################
void GI::Dev::Screen::drawHLine(signed int X1, signed int X2, signed int Y,
		unsigned char width, unsigned int color)
{
	if (width == 1 && (Y < sClipRegion.sYMin || Y >= sClipRegion.sYMax))
		return;
	register int X1_Tmp = X1, X2_Tmp = X1 + X2;
	if (X1_Tmp <= (int) sClipRegion.sXMin)
		X1_Tmp = (int) sClipRegion.sXMin;
	if (X1_Tmp >= (int) sClipRegion.sXMax)
		X1_Tmp = (int) sClipRegion.sXMax;
	if (X2_Tmp <= (int) sClipRegion.sXMin)
		X2_Tmp = (int) sClipRegion.sXMin;
	if (X2_Tmp >= (int) sClipRegion.sXMax)
		X2_Tmp = (int) sClipRegion.sXMax;
	Y -= (width >> 1);
	if (Y < (int) sClipRegion.sYMin)
		Y = (int) sClipRegion.sYMin;
	if (Y >= (int) sClipRegion.sYMax)
		Y = (int) sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	unsigned int _color = color;
#else
	unsigned int _color = color | 0xFF000000;
#endif
	uint32_t Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
			+ 4 * (LcdTimings->X * Y + X1_Tmp);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *) Xaddress, X2_Tmp - X1_Tmp, width,
			LcdTimings->X - (X2_Tmp - X1_Tmp), _color);

}
//#######################################################################################
void GI::Dev::Screen::drawVLine(signed int Y1, signed int Y2, signed int X,
		unsigned char width, unsigned int color)
{
	if (width == 1 && (X < sClipRegion.sXMin || X >= sClipRegion.sXMax))
		return;
	register int Y1_Tmp = Y1, Y2_Tmp = Y1 + Y2;
	X -= (width >> 1);
	if (X <= (int) sClipRegion.sXMin)
		X = (int) sClipRegion.sXMin;
	if (X >= (int) sClipRegion.sXMax)
		X = (int) sClipRegion.sXMax;
	if (Y1_Tmp <= (int) sClipRegion.sYMin)
		Y1_Tmp = (int) sClipRegion.sYMin;
	if (Y1_Tmp >= (int) sClipRegion.sYMax)
		Y1_Tmp = (int) sClipRegion.sYMax;
	if (Y2_Tmp <= (int) sClipRegion.sYMin)
		Y2_Tmp = (int) sClipRegion.sYMin;
	if (Y2_Tmp >= (int) sClipRegion.sYMax)
		Y2_Tmp = (int) sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	unsigned int _color = color;
#else
	unsigned int _color = color | 0xFF000000;
#endif
	uint32_t Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
			+ 4 * (LcdTimings->X * Y1_Tmp + X);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *) Xaddress, width, Y2_Tmp - Y1_Tmp,
			LcdTimings->X - (width), _color);

}
//#######################################################################################
void GI::Dev::Screen::clear(unsigned int color)
{
	drawRectangle(0, 0, LcdTimings->X, LcdTimings->Y, true, color);
}
//#######################################################################################
void GI::Dev::Screen::drawTouchPoint(signed int X, signed int Y,
		unsigned int color)
{
	drawHLine(X - 7, 6, Y, 1, color);
	drawHLine(X + 2, 6, Y, 1, color);
	drawVLine(Y - 7, 6, X, 1, color);
	drawVLine(Y + 2, 6, X, 1, color);
}
//#######################################################################################
//void put_pixel(void *pDisplay, signed int X, signed int Y, unsigned int color);
void GI::Dev::Screen::drawCircle(signed int x, signed int y, signed int _radius,
		unsigned char fill, unsigned int color)
{
	signed int radius = _radius;
	if (radius < 0)
		radius = ~radius;
	signed int a, b, P;

	a = 0;
	b = radius;
	P = 1 - radius;
	signed int Tmp1;
	signed int Tmp2;
	signed int Tmp3;
	signed int Tmp4;
	signed int Tmp5;
	signed int Tmp6;
	signed int Tmp7;
	signed int Tmp8;
	signed int _Tmp5 = 5, _Tmp7 = 0;

	do
	{
		Tmp1 = x + a;
		Tmp2 = x - a;
		Tmp3 = x + b;
		Tmp4 = x - b;
		Tmp5 = y + a;
		Tmp6 = y - a;
		Tmp7 = y + b;
		Tmp8 = y - b;
		if (fill)
		{

			if (_Tmp7 != Tmp7)
			{
				drawHLine(Tmp2, Tmp1, Tmp7, 1, color);
				drawHLine(Tmp2, Tmp1, Tmp8, 1, color);
			}
			if (_Tmp5 != Tmp5)
			{
				drawHLine(Tmp4, Tmp3, Tmp5, 1, color);
				drawHLine(Tmp4, Tmp3, Tmp6, 1, color);
			}
			_Tmp5 = Tmp5;
			_Tmp7 = Tmp7;
		}
		else
		{
			drawPixel(Tmp1, Tmp7, color);
			drawPixel(Tmp3, Tmp5, color);
			drawPixel(Tmp2, Tmp7, color);
			drawPixel(Tmp4, Tmp5, color);
			drawPixel(Tmp3, Tmp6, color);
			drawPixel(Tmp1, Tmp8, color);
			drawPixel(Tmp2, Tmp8, color);
			drawPixel(Tmp4, Tmp6, color);
		}

		if (P < 0)
			P += 3 + 2 * a++;
		else
			P += 5 + 2 * (a++ - b--);
	} while (a <= b);
}
//#######################################################################################
void GI::Dev::Screen::drawLine(signed int X1, signed int Y1, signed int X2,
		signed int Y2, unsigned char width, unsigned int color)
{
	/*if(X1 > X2)
	 {
	 int Tmp = X1;
	 X1 = X2;
	 X2 = Tmp;
	 }
	 if(Y1 > Y2)
	 {
	 int Tmp = Y1;
	 Y1 = Y2;
	 Y2 = Tmp;
	 }*/
	if (width == 1)
	{
		signed int CurrentX, CurrentY, Xinc, Yinc, Dx, Dy, TwoDx, TwoDy,
				TwoDxAccumulatedError, TwoDyAccumulatedError;
		Dx = (X2 - X1);
		Dy = (Y2 - Y1);
		TwoDx = Dx + Dx;
		TwoDy = Dy + Dy;
		CurrentX = X1;
		CurrentY = Y1;
		Xinc = 1;
		Yinc = 1;
		if (Dx < 0)
		{
			Xinc = -1;
			Dx = -Dx;
			TwoDx = -TwoDx;
		}
		if (Dy < 0)
		{
			Yinc = -1;
			Dy = -Dy;
			TwoDy = -TwoDy;
		}
		drawPixel(X1, Y1, color);
		if ((Dx != 0) || (Dy != 0))
		{
			if (Dy <= Dx)
			{
				TwoDxAccumulatedError = 0;
				do
				{
					CurrentX += Xinc;
					TwoDxAccumulatedError += TwoDy;
					if (TwoDxAccumulatedError > Dx)
					{
						CurrentY += Yinc;
						TwoDxAccumulatedError -= TwoDx;
					}
					drawPixel(CurrentX, CurrentY, color);
				} while (CurrentX != X2);
			}
			else
			{
				TwoDyAccumulatedError = 0;
				do
				{
					CurrentY += Yinc;
					TwoDyAccumulatedError += TwoDx;
					if (TwoDyAccumulatedError > Dy)
					{
						CurrentX += Xinc;
						TwoDyAccumulatedError -= TwoDy;
					}
					drawPixel(CurrentX, CurrentY, color);
				} while (CurrentY != Y2);
			}
		}
	}
	else
	{
		signed int half_width;
		signed int dy, dx;
		signed int addx = 1, addy = 1, j;
		signed int P, diff;
		signed int c1, c2;

		int i = 0;
		dx = X2 - X1;
		dy = Y2 - Y1;

