MorgothCreator/CppSDK/SDK/platform/stm32f7/interface/screen.cpp
		half_width = width / 2;
		c1 = -(dx * X1 + dy * Y1);
		c2 = -(dx * X2 + dy * Y2);

		if (X1 > X2)
		{
			signed int temp;
			temp = c1;
			c1 = c2;
			c2 = temp;
			addx = -1;
		}
		if (Y1 > Y2)
		{
			signed int temp;
			temp = c1;
			c1 = c2;
			c2 = temp;
			addy = -1;
		}

		if (dx >= dy)
		{
			P = 2 * dy - dx;
			diff = P - dx;

			for (i = 0; i <= dx; ++i)
			{
#ifdef Use_FastDrawBar
				LcdStruct->lcd_func.screen_draw_vertical_line(pContext,Y1+ (-half_width), Y1+ (half_width+width%2), X1, 1);
#else
				for (j = -half_width; j < half_width + width % 2; ++j)
				{
					signed int temp;

					temp = dx * X1 + dy * (Y1 + j); // Use more RAM to increase speed
					if (temp + c1 >= 0 && temp + c2 <= 0)
						drawPixel(X1, Y1 + j, color);
				}
#endif
				if (P < 0)
				{
					P += 2 * dy;
					X1 += addx;
				}
				else
				{
					P += diff;
					X1 += addx;
					Y1 += addy;
				}
			}
		}
		else
		{
			P = 2 * dx - dy;
			diff = P - dy;

			for (i = 0; i <= dy; ++i)
			{
				if (P < 0)
				{
					P += 2 * dx;
					Y1 += addy;
				}
				else
				{
					P += diff;
					X1 += addx;
					Y1 += addy;
				}
#ifdef Use_FastDrawBar
				LcdStruct->lcd_func.put_horizontal_line(pContext,(X1+(-half_width)), (X1+(half_width+width%2)), Y1, 1);
#else
				for (j = -half_width; j < half_width + width % 2; ++j)
				{
					signed int temp;

					temp = dx * X1 + dy * (Y1 + j); // Use more RAM to increase speed
					if (temp + c1 >= 0 && temp + c2 <= 0)
						drawPixel(X1 + j, Y1, color);
				}
#endif
			}
		}
	}
}
//#######################################################################################
static void elipseplot(GI::Dev::Screen *pDisplay, signed int xc, signed int yc,
		signed int x, signed int y, unsigned char Fill, unsigned int color)
{
	int Tmp1 = xc + x;
	int Tmp2 = xc - x;
	int Tmp3 = yc + y;
	int Tmp4 = yc - y;

	if (Fill)
	{
		pDisplay->drawHLine(Tmp2, Tmp1, Tmp3, 1, color);
		pDisplay->drawHLine(Tmp2, Tmp1, Tmp4, 1, color);
	}
	else
	{
		pDisplay->drawPixel((unsigned int) (Tmp1), (unsigned int) (Tmp3),
				color);
		pDisplay->drawPixel((unsigned int) (Tmp2), (unsigned int) (Tmp3),
				color);
		pDisplay->drawPixel((unsigned int) (Tmp1), (unsigned int) (Tmp4),
				color);
		pDisplay->drawPixel((unsigned int) (Tmp2), (unsigned int) (Tmp4),
				color);
	}
}
//----------------------------------------------------------------------------------------
void GI::Dev::Screen::drawElipse(signed int xc, signed int yc, signed int _rx,
		signed int _ry, unsigned char Fill, unsigned int color)
{
	signed int rx = _rx;
	if (rx < 0)
		rx = 0xFFFFFFFF - rx;
	signed int ry = _ry;
	if (ry < 0)
		ry = 0xFFFFFFFF - ry;
	int rx2 = rx * rx;
	int ry2 = ry * ry;
	int tory2 = 2 * ry2;
	int torx2 = 2 * rx2;
	int p;
	int x = 0;
	int y = ry;
	int py = torx2 * y;
	int px = 0;
	elipseplot(this, xc, yc, x, y, Fill, color);
	p = /*round(*/ry2 - (rx2 * ry) + (0.25 * rx2)/*)*/;
	while (px < py)
	{
		x++;
		px += tory2;
		if (p < 0)
			p += ry2 + px;
		else
		{
			y--;
			py -= torx2;
			p += ry2 + px - py;
		}
		elipseplot(this, xc, yc, x, y, Fill, color);
	}
	p = /*round(*/ry2 * (x + 0.5) * (x + 0.5) + rx2 * (y - 1) * (y - 1)
			- rx2 * ry2/*)*/;
	while (y > 0)
	{
		y--;
		py -= torx2;
		if (p > 0)
			p += rx2 - py;
		else
		{
			x++;
			px += tory2;
			p += rx2 - py + px;
		}
		elipseplot(this, xc, yc, x, y, Fill, color);
	}
}
//#######################################################################################
/*
 *  the coordinates of vertices are (A.x,A.y), (B.x,B.y), (C.x,C.y); we assume that A.y<=B.y<=C.y (you should sort them first)
 * dx1,dx2,dx3 are deltas used in interpolation
 * horizline draws horizontal segment with coordinates (S.x,Y), (E.x,Y)
 * S.x, E.x are left and right x-coordinates of the segment we have to draw
 * S=A means that S.x=A.x; S.y=A.y;
 */

static void triangle_swap_nibble(signed int* a, signed int *b)
{
	signed int t = *a;
	*a = *b;
	*b = t;
}

void GI::Dev::Screen::drawTriangle(signed int Ax, signed int Ay, signed int Bx,
		signed int By, signed int Cx, signed int Cy, unsigned char Fill,
		unsigned int color)
{
	//tDisplay* LcdStruct = (tDisplay *) pDisplay;
	signed long dx1, dx2, dx3;
	signed long Sx, Ex;
	signed int Sy, Ey;

	if (Ay > By)
	{
		triangle_swap_nibble(&Ay, &By);
		triangle_swap_nibble(&Ax, &Bx);
	}
	if (Ay > Cy)
	{
		triangle_swap_nibble(&Ay, &Cy);
		triangle_swap_nibble(&Ax, &Cx);
	}
	if (By > Cy)
	{
		triangle_swap_nibble(&By, &Cy);
		triangle_swap_nibble(&Bx, &Cx);
	}
	if (By - Ay > 0)
		dx1 = ((signed long) (Bx - Ax) << 16) / (By - Ay);
	else
		dx1 = 0;
	if (Cy - Ay > 0)
		dx2 = ((signed long) (Cx - Ax) << 16) / (Cy - Ay);
	else
		dx2 = 0;
	if (Cy - By > 0)
		dx3 = ((signed long) (Cx - Bx) << 16) / (Cy - By);
	else
		dx3 = 0;

	Ex = Sx = (signed long) Ax << 16;
	Ey = Sy = Ay;

	if (dx1 > dx2)
	{
		while (Sy <= By)
		{
			drawLine(Sx >> 16, Sy++, Ex >> 16, Ey++, 1, color);
			Sx += dx2;
			Ex += dx1;
		}
		Ex = (signed long) Bx << 16;
		Ey = By;
		while (Sy <= Cy)
		{
			drawLine(Sx >> 16, Sy++, Ex >> 16, Ey++, 1, color);
			Sx += dx2;
			Ex += dx3;
		}
	}
	else
	{
		while (Sy <= By)
		{
			drawLine(Sx >> 16, Sy++, Ex >> 16, Ey++, 1, color);
			Sx += dx1;
			Ex += dx2;
		}
		Sx = (signed long) Bx << 16;
		Sy = By;
		while (Sy <= Cy)
		{
			drawLine(Sx >> 16, Sy++, Ex >> 16, Ey++, 1, color);
			Sx += dx3;
			Ex += dx2;
		}
	}
}
//#######################################################################################

#else
#endif
